#include "Plain_Tree.h"

//--------------------------------------------------------------------------------------------------------------
template <typename T>
Tree<T>::~Tree()
{

}
//--------------------------------------------------------------------------------------------------------------
template <typename T>
Tree<T>::Tree() :  root_(nullptr), size_(0)
{}
//--------------------------------------------------------------------------------------------------------------
template <typename T>
void Tree<T>::Insert(T elem)
{
/* Алгоритм
 * 1. Проверяем не пуста ли наша структура данных
 * 2. если root = nullptr, присваиваем корню переданное значение
 * 3. если элементы есть
 * 3.1. пройтись по всем возможным вариантам и проверить на больше-меньше переданное значение
 * 3.2. записать новое значение в левую или правую часть - в зависимости от его значения
 * P.S.: не забыть остановить бесконечный цикл!
 */

    ++size_; // увеличение счетчика по умолчанию

    if (root_ == nullptr)
        root_ = new Node<T>(elem);
    else
    {
        Node <T> *current = root_;
        bool flag = true;

        while (flag)
        {
            if (elem < current->data_)
            {
                if (current->left_ == nullptr)
                {
                    current->left_ = new Node<T>(elem);
                    flag = false;
                }
                else
                    current = current->left_;
            }
            else if (elem > current->data_)
            {
                if (current->right_ == nullptr)
                {
                    current->right_ = new Node<T>(elem);
                    flag = false;
                }
                else
                    current = current->right_;
            }
            else  // numbers are equal; No new work has to be done;
            {
                flag = false;
                --size_; // сброс счетчика, раз добавления не произошло
            }
        }
    }
}
//--------------------------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------------------------
