#include "List.h"

List::iterator::iterator(Node *t) noexcept
{

}
//--------------------------------------------------
List::iterator::iterator() noexcept
{

}
//--------------------------------------------------
bool List::iterator::operator==(const iterator &it) const noexcept
{

}
//--------------------------------------------------
bool List::iterator::operator!=(const iterator &it) const noexcept
{

}
//--------------------------------------------------
List::iterator &List::iterator::operator++()
{

}
//--------------------------------------------------
List::iterator &List::iterator::operator--()
{

}
//--------------------------------------------------
List::reference List::iterator::operator*()
{

}
//--------------------------------------------------
List::List()
{}
//--------------------------------------------------
List::~List()
{

}
//--------------------------------------------------
List::List(const std::initializer_list <value_type> &t)
{

}
//--------------------------------------------------
List::List(const List &other)
{

}
//--------------------------------------------------
List::List(List &&other) noexcept
{

}
//--------------------------------------------------
List &List::operator=(List &&other) noexcept
{

}
//--------------------------------------------------
List &List::operator=(const List &other)
{

}
//--------------------------------------------------
List::iterator List::begin() noexcept
{

}
//--------------------------------------------------
List::iterator List::end() noexcept
{

}
//--------------------------------------------------
List::reference List::front()
{

}
//--------------------------------------------------
List::reference List::back()
{

}
//--------------------------------------------------
bool List::empty() const noexcept
{

}
//--------------------------------------------------
List::size_type List::size() const noexcept
{

}
//--------------------------------------------------
void List::push_front(const_reference)
{ // добавить в начало

}
//--------------------------------------------------
void List::push_front(value_type &&)
{ // добавить в начало - временный объект --

}
//--------------------------------------------------
void List::pop_front()
{ // удалить первый

}
//--------------------------------------------------
void List::push_back(const_reference)
{ // добавить в конец

}
//--------------------------------------------------
void List::push_back(value_type &&)
{ // добавить в начало - временный объект --

}
//--------------------------------------------------
void List::pop_back()
{ // удалить последний

}
//--------------------------------------------------
List::iterator List::insert(iterator, const_reference)
{ // вставить в позицию итератора

}
//--------------------------------------------------
List::iterator List::insert(iterator, value_type &&)
{ // вставить временный объект --

}
//--------------------------------------------------
List::iterator List::erase(iterator)
{ // удалить указанный (в позиции)

}
//--------------------------------------------------
void List::clear()
{ // удалить все

}
//--------------------------------------------------
void List::swap(List &t) noexcept
{ // обменять с заданным списком

}
//--------------------------------------------------
