#include "List.h"

// class iterator
//----------------------------------------------------------------------
List::iterator::iterator(Node *t) noexcept
{}
//----------------------------------------------------------------------
List::iterator::iterator() noexcept
{}
//----------------------------------------------------------------------
bool List::iterator::operator==(const iterator &it) const noexcept
{}
//----------------------------------------------------------------------
bool List::iterator::operator!=(const iterator &it) const noexcept
{}
//----------------------------------------------------------------------
List::iterator &List::iterator::operator++()
{}
//----------------------------------------------------------------------
List::iterator &List::iterator::operator--()
{}
//----------------------------------------------------------------------
List::reference List::iterator::operator*()
{}
//----------------------------------------------------------------------




// class List
//----------------------------------------------------------------------
List::List()
: head_(nullptr), tail_(nullptr), size_(0)
{}
//----------------------------------------------------------------------
List::~List()
{}
//----------------------------------------------------------------------
List::List(const std::initializer_list<value_type> &t)
: head_(nullptr), tail_(nullptr), size_(t.size())
{}
//----------------------------------------------------------------------
List::List(const List& other)
{}
//----------------------------------------------------------------------
List::List(List&& other) noexcept
{ // -- конструктор переноса --

}
//----------------------------------------------------------------------
List &List::operator=(List&& other) noexcept
{ // -- операция перемещения --

}
//----------------------------------------------------------------------
List &List::operator=(const List& other)
{}
//----------------------------------------------------------------------
List::iterator List::begin() noexcept
{}
//----------------------------------------------------------------------
List::iterator List::end() noexcept
{}
//----------------------------------------------------------------------
List::reference List::front()
{}
//----------------------------------------------------------------------
List::reference List::back()
{}
//----------------------------------------------------------------------
bool List::empty() const noexcept
{
    return size_ == 0;
}
//----------------------------------------------------------------------
List::size_type List::size() const noexcept
{
    return size_;
}
//----------------------------------------------------------------------
void List::push_front(const_reference rhs)
{ // добавить в начало; Time Complexity: O(1)
    // 1. allocate node
    Node *new_node = new Node();

    // 2. put in the data
    new_node->data_ = rhs.data_;

    // 3. Make next of new node as head and previous as NULL
    new_node->next_ = (*head_);
    new_node->prev_ = nullptr;

    // 4. change prev of head node to new node
    if ((*head_) != nullptr)
        (*head_)->prev_ = new_node;

    // 5. move the head to point to the new node
    (*head_) = new_node;
    ++size_;
}
//----------------------------------------------------------------------
void List::push_front(value_type &&tmp)
{ // добавить в начало - временный объект --

}
//----------------------------------------------------------------------
void List::pop_front()
{ // удалить первый

}
//----------------------------------------------------------------------
void List::push_back(const_reference)
{ // добавить в конец

}
//----------------------------------------------------------------------
void List::push_back(value_type &&)
{ // добавить в начало - временный объект --

}
//----------------------------------------------------------------------
void List::pop_back()
{ // удалить последний

}
//----------------------------------------------------------------------
List::iterator List::insert(iterator, const_reference)
{ // вставить в позицию итератора

}
//----------------------------------------------------------------------
List::iterator List::insert(iterator, value_type&&)
{  // вставить временный объект --

}
//----------------------------------------------------------------------
List::iterator List::erase(iterator)
{ // удалить указанный (в позиции)

}
//----------------------------------------------------------------------
void List::clear()
{ // удалить все
    size_ = 0;
    head_ = nullptr;
    tail_ = nullptr;
}
//----------------------------------------------------------------------
void List::swap(List &t) noexcept
{

}
//----------------------------------------------------------------------